tests/cassettes/test_price/TestPrice.test_update_price.yaml

interactions:
- request:
    body: '{"description": "Test Price Updated", "billing_cycle": {"interval": "month",
      "frequency": 1}, "tax_mode": "account_setting", "unit_price": {"amount": "1200",
      "currency_code": "USD"}}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer 559a1eb08e249528c6d897ef407aedbb13fd8d73e0234bafc1
      Connection:
      - keep-alive
      Content-Length:
      - '182'
      Content-type:
      - application/json
      User-Agent:
      - python-requests/2.31.0
    method: PATCH
    uri: https://sandbox-api.paddle.com/prices/pri_01h8xce4x86pq3byesf71a7kw1
  response:
    body:
      string: '{"data":{"id":"pri_01h8xce4x86pq3byesf71a7kw1","product_id":"pro_01h89b2j66qq82x6vn5d39c4av","description":"Test
        Price Updated","billing_cycle":{"interval":"month","frequency":1},"trial_period":null,"tax_mode":"account_setting","unit_price":{"amount":"1200","currency_code":"USD"},"unit_price_overrides":[],"custom_data":null,"status":"active","quantity":{"minimum":1,"maximum":100}},"meta":{"request_id":"213c471d-a71c-43f0-b336-34ff914166d3"}}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 7fda7a70dda01e53-FRA
      Cache-Control:
      - no-store, max-age=0
      Connection:
      - keep-alive
      Content-Security-Policy:
      - default-src 'none'; frame-ancestors 'none'; base-uri 'none'
      Content-Type:
      - application/json
      Cross-Origin-Embedder-Policy:
      - require-corp
      Cross-Origin-Opener-Policy:
      - same-origin
      Cross-Origin-Resource-Policy:
      - same-site
      Date:
      - Mon, 28 Aug 2023 06:25:40 GMT
      Permissions-Policy:
      - accelerometer=(),ambient-light-sensor=(),autoplay=(),battery=(),camera=(),display-capture=(),document-domain=(),encrypted-media=(),fullscreen=(),gamepad=(),geolocation=(),gyroscope=(),layout-animations=(self),legacy-image-formats=(self),magnetometer=(),microphone=(),midi=(),oversized-images=(self),payment=(),picture-in-picture=(),publickey-credentials-get=(),speaker-selection=(),sync-xhr=(self),unoptimized-images=(self),unsized-media=(self),usb=(),screen-wake-lock=(),web-share=(),xr-spatial-tracking=()
      Pragma:
      - no-cache
      Referrer-Policy:
      - no-referrer
      Request-Id:
      - 213c471d-a71c-43f0-b336-34ff914166d3
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=4EmGWsdKdVv43WwMwQv3sqvstGvkJ5rLWxrmnKkOooc-1693203940-0-AVxyIXwVmSmzb3CidxZbylQeEUKrm9z0CN85G1oN8JEsY0A1h1X3NAD9VOX/25KmuqQiz8K1I9FLRxDp4HhyXKc=;
        path=/; expires=Mon, 28-Aug-23 06:55:40 GMT; domain=.paddle.com; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Transfer-Encoding:
      - chunked
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - deny
      X-Permitted-Cross-Domain-Policies:
      - none
      content-length:
      - '445'
    status:
      code: 200
      message: OK
version: 1
